In [2]:
import pandas as pd
import numpy as np

In [4]:
np.random.seed(101)
df=pd.DataFrame(data=np.random.randn(5,5),index='a b c d e'.split(),columns=['Val1 Val2 Val3 Val4 Val5'.split()])
df

       Val1      Val2      Val3      Val4      Val5
a  2.706850  0.628133  0.907969  0.503826  0.651118
b -0.319318 -0.848077  0.605965 -2.018168  0.740122
c  0.528813 -0.589001  0.188695 -0.758872 -0.933237
d  0.955057  0.190794  1.978757  2.605967  0.683509
e  0.302665  1.693723 -1.706086 -1.159119 -0.134841

# Single Selection

In [10]:
print(df['Val1'])
df.Val1
df['Val1'].values

       Val1
a  2.706850
b -0.319318
c  0.528813
d  0.955057
e  0.302665

array([[ 2.70684984],
       [-0.31931804],
       [ 0.52881349],
       [ 0.95505651],
       [ 0.30266545]])

In [15]:
df[['Val1']]['a':'c']

       Val1
a  2.706850
b -0.319318
c  0.528813

In [12]:
df[['Val1']][0:3]

       Val1
a  2.706850
b -0.319318
c  0.528813

In [13]:
df[['Val1']][::-1]

       Val1
e  0.302665
d  0.955057
c  0.528813
b -0.319318
a  2.706850

In [16]:
np.random.seed(101)
df=pd.DataFrame(data=np.random.randn(5,5),index='a b c d e'.split(),columns=['Val1 Val2 Val3 Val4 Val5'.split()])
df

       Val1      Val2      Val3      Val4      Val5
a  2.706850  0.628133  0.907969  0.503826  0.651118
b -0.319318 -0.848077  0.605965 -2.018168  0.740122
c  0.528813 -0.589001  0.188695 -0.758872 -0.933237
d  0.955057  0.190794  1.978757  2.605967  0.683509
e  0.302665  1.693723 -1.706086 -1.159119 -0.134841

# Multiple Selection

In [18]:
df[['Val2','Val4']]

       Val2      Val4
a  0.628133  0.503826
b -0.848077 -2.018168
c -0.589001 -0.758872
d  0.190794  2.605967
e  1.693723 -1.159119

In [21]:
result=df[['Val1','Val5']]
result

       Val1      Val5
a  2.706850  0.651118
b -0.319318  0.740122
c  0.528813 -0.933237
d  0.955057  0.683509
e  0.302665 -0.134841

In [23]:
df['b':'d']

       Val1      Val2      Val3      Val4      Val5
b -0.319318 -0.848077  0.605965 -2.018168  0.740122
c  0.528813 -0.589001  0.188695 -0.758872 -0.933237
d  0.955057  0.190794  1.978757  2.605967  0.683509

In [26]:
df[0:3]

       Val1      Val2      Val3      Val4      Val5
a  2.706850  0.628133  0.907969  0.503826  0.651118
b -0.319318 -0.848077  0.605965 -2.018168  0.740122
c  0.528813 -0.589001  0.188695 -0.758872 -0.933237

In [29]:
df['e':'e']

       Val1      Val2      Val3      Val4      Val5
e  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [30]:
df['e':'e'][['Val1','Val4']]

       Val1      Val4
e  0.302665 -1.159119

# LOC and ILOC

In [31]:
np.random.seed(101)

arr=np.random.randint(0,50,(10,5))
df=pd.DataFrame(data=arr,index='a b c d e f g h i j'.split(),columns=['Val1 Val2 Val3 Val4 Val5'.split()])

df

  Val1 Val2 Val3 Val4 Val5
a   31   11   17    6   23
b   11   47    9   13   40
c    4   40   28    0   46
d    5   12   29   40   49
e   19   47    8   29   34
f   44    8   19   10   12
g   31   43   23    0   41
h    9   47    8   36   19
i   35   28    7   10   39
j   38   46    9   18    7

In [32]:
df.loc['a':'c']

  Val1 Val2 Val3 Val4 Val5
a   31   11   17    6   23
b   11   47    9   13   40
c    4   40   28    0   46

In [33]:
df.iloc[0:3]

  Val1 Val2 Val3 Val4 Val5
a   31   11   17    6   23
b   11   47    9   13   40
c    4   40   28    0   46

In [34]:
df.loc['b','Val3']

Val3    9
Name: b, dtype: int32

In [36]:
df.iloc[1,2]

9